var num = "htllo worldasd";
console.log(num);

// var name = prompt("Введите ваше имя ...")

// console.log("Ваше имя - " + name)

var firstNum = 12;
var secondNum = 23;

var colors = ["red", "blue", "yellow"];
var colors2 = new Array ("red", "green", "black");
colors2[3] += ["pink"];







document.write(colors2[3]);
// document.write("Результат сложения программы - ", firstNum + secondNum)









// "use strict" - объявляется в начале файла и переводит весь скрипт в строгий режим
// var - устаревшее объявление переменной
// let - современное объявление переменной
// const - объявление константы, значение которой нельзя поменять,
// хорошая практика использования констант в ВЕРХНЕМ регистре для "жестко закодированных значение(цветов)"
// const bigInt = 1234567890123456789012345678901234567890n - определяется bigInt(огромное значение числа
        // В строках есть еще обратные кавычки
// let str = "Привет";
// let str2 = 'Одинарные кавычки тоже подойдут';
// let phrase = `Обратные кавычки позволяют встраивать переменные ${str}`;

// значение "null" показывает ничего, пусто, не имеет ссылки на объект
// значение "undefined" представляет что "значение не было присвоено(если
// переменная объявлена, но ей не присвоено никакого значения)


//          преобразование типов:
// String(num)
// Number(str)
// Boolean(sdf)     - любая не пустая строка возвращает true





