let title2 = "This is title two";
let title = "This is simple title";

let num = "123";
let str = -0;
// alert(typeof(String(str)));
// alert(typeof(Number(num)));
// alert(typeof(Boolean(num)));
alert(Boolean(str));



// let ifboo = confirm("желаете ли ввести ваше имя?");
// if (ifboo){
//     let name = prompt("Введите ваше имя");
//     alert("ваше имя: " + name)
// }
















// "use strict" - объявляется в начале файла и переводит весь скрипт в строгий режим
// var - устаревшее объявление переменной
// let - современное объявление переменной
// const - объявление константы, значение которой нельзя поменять,
// хорошая практика использования констант в ВЕРХНЕМ регистре для "жестко закодированных значение(цветов)"
// const bigInt = 1234567890123456789012345678901234567890n - определяется bigInt(огромное значение числа
        // В строках есть еще обратные кавычки
// let str = "Привет";
// let str2 = 'Одинарные кавычки тоже подойдут';
// let phrase = `Обратные кавычки позволяют встраивать переменные ${str}`;

// значение "null" показывает ничего, пусто, не имеет ссылки на объект
// значение "undefined" представляет что "значение не было присвоено(если
// переменная объявлена, но ей не присвоено никакого значения)


//          преобразование типов:
// String(num)
// Number(str)
// Boolean(sdf)     - любая не пустая строка возвращает true





